Revit 2016 API
BaseImportOptions Methods
The BaseImportOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLayerSelection
 Get all set layers name which user want to import into Revit.
GetRefPoint |  Obsolete.
 Gets the 3D point in the document where the imported instance will be inserted.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetLayerSelection
 Set the layers name which user want to import into Revit.
SetRefPoint |  Obsolete.
 Sets the 3D point in the document where the imported instance will be inserted. If not explicitly set, the instance will be inserted at the document origin.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace